In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

Import Data

In [25]:
inflasi = pd.read_csv('/home/margaretawdy/Downloads/Inflasi.csv')

In [26]:
inflasi = pd.DataFrame(inflasi)

In [27]:
inflasi.head(10)

            Month Inflasi
0       Juni 2019   3.28%
1        Mei 2019   3.32%
2      April 2019   2.83%
3      Maret 2019   2.48%
4   Februari 2019   2.57%
5    Januari 2019   2.82%
6   Desember 2018   3.13%
7   Nopember 2018   3.23%
8    Oktober 2018   3.16%
9  September 2018   2.88%

Memisahkan tahun dan bulan pada 'Month' dan membuat kolom baru bernama 'Bulan' dan 'Tahun'

In [28]:
inflasi.dropna(inplace=True)
new = inflasi['Month'].str.split(" ", n=1, expand=True)

In [29]:
inflasi['Bulan'] = new[0]
inflasi['Tahun'] = new[1]
inflasi.drop(columns=['Month'], inplace=True)

In [30]:
inflasi.head(10)

  Inflasi      Bulan Tahun
0   3.28%       Juni  2019
1   3.32%        Mei  2019
2   2.83%      April  2019
3   2.48%      Maret  2019
4   2.57%   Februari  2019
5   2.82%    Januari  2019
6   3.13%   Desember  2018
7   3.23%   Nopember  2018
8   3.16%    Oktober  2018
9   2.88%  September  2018

Menghilangkan simbol '%' pada 'Inflasi' dan merubah type data menjadi int/float agar dapat dikalkulasi

In [31]:
inflasi['Inflasi'] = inflasi['Inflasi'].str.split("%", n=1, expand=True)

In [32]:
inflasi['Inflasi'] = pd.to_numeric(inflasi['Inflasi'])

In [33]:
inflasi.head(5)

   Inflasi     Bulan Tahun
0     3.28      Juni  2019
1     3.32       Mei  2019
2     2.83     April  2019
3     2.48     Maret  2019
4     2.57  Februari  2019

Mengurutkan kolom agar mudah terbaca menjadi 'Bulan'-'Tahun'-'Inflasi'

In [34]:
inflasi = pd.DataFrame(inflasi, columns=['Bulan', 'Tahun', 'Inflasi'])

In [35]:
inflasi.head(5)

      Bulan Tahun  Inflasi
0      Juni  2019     3.28
1       Mei  2019     3.32
2     April  2019     2.83
3     Maret  2019     2.48
4  Februari  2019     2.57

In [65]:
totalInflasi = inflasi.groupby('Tahun', as_index=False).agg({'Inflasi':'sum'})

In [78]:
totalInflasi.head(5)

  Tahun  Total Inflasi per Tahun  Rata-rata Inflasi per Tahun
0  2002                     0.00                     0.000000
1  2003                    81.48                     6.790000
2  2004                    72.69                     6.057500
3  2005                   124.83                    10.402500
4  2006                   159.98                    13.331667

In [67]:
rataRataInflasi = newInflasi.groupby('Tahun', as_index=False).agg({'Inflasi': 'mean'})

In [79]:
rataRataInflasi.head(5)

  Tahun    Inflasi
0  2002   0.000000
1  2003   6.790000
2  2004   6.057500
3  2005  10.402500
4  2006  13.331667

In [69]:
newInflasi = totalInflasi

In [72]:
newInflasi['Rata-rata Inflasi per Tahun'] = rataRataInflasi['Inflasi']

In [76]:
newInflasi.columns = ['Tahun', 'Total Inflasi per Tahun', 'Rata-rata Inflasi per Tahun']

In [77]:
newInflasi

   Tahun  Total Inflasi per Tahun  Rata-rata Inflasi per Tahun
0   2002                     0.00                     0.000000
1   2003                    81.48                     6.790000
2   2004                    72.69                     6.057500
3   2005                   124.83                    10.402500
4   2006                   159.98                    13.331667
5   2007                    76.85                     6.404167
6   2008                   123.70                    10.308333
7   2009                    58.74                     4.895000
8   2010                    61.50                     5.125000
9   2011                    64.56                     5.380000
10  2012                    51.34                     4.278333
11  2013                    83.59                     6.965833
12  2014                    77.03                     6.419167
13  2015                    76.59                     6.382500
14  2016                    42.37                     3.530833
15  2017                    45.71                     3.809167
16  2018                    38.37                     3.197500
17  2019                    17.30                     2.883333

Didapatkan rata-rata inflasi sesuai dengan yang ada pada kolom 'Rata-rata Inflasi per Tahun'